Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
        // Check if this is a self-transmitted frame
        // Use hash of CAN ID to start search for better cache locality
        bool is_self_tx = false;
        bool loopback_requested = false;
        uint8_t start_idx = (message.identifier & 0xFF) % TX_TRACKER_SIZE;
        for (uint8_t j = 0; j < TX_TRACKER_SIZE; j++) {
            uint8_t i = (start_idx + j) % TX_TRACKER_SIZE;
            if (iface->tx_tracker[i].can_id == message.identifier &&
                iface->tx_tracker[i].timestamp_us != 0) {
                is_self_tx = true;
                loopback_requested = iface->tx_tracker[i].loopback_requested;
                iface->tx_tracker[i].timestamp_us = 0; // Clear entry
                break;
            }
        }

        if (is_self_tx && !loopback_requested) {
            // Self-transmitted frame without loopback - drop it silently
            continue;
        }
        
        if (is_self_tx && loopback_requested) {
            rx_item.flags = AP_HAL::CANIface::Loopback;
        }

        // Update statistics
        iface->update_rx_stats();

        if (!iface->add_to_rx_queue(rx_item)) {
            // Queue full - frame dropped silently to avoid slowing down RX
            iface->update_error_stats(0x04); // Queue full error
        }
    }
}

void CANIface::tx_task(void *arg)
{
    CANIface *iface = (CANIface *)arg;

    // Register this task with watchdog
    ESP32::Scheduler::register_task_with_watchdog("can_tx");

    CanTxItem tx_item;

    while (true) {
        // Check if restart is in progress
        if (iface->restart_in_progress) {
            // During restart, just wait without trying to transmit
            // Reset watchdog during the wait to prevent timeout
            esp_task_wdt_reset();
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        // Wait for a frame from the queue
        if (xQueueReceive(iface->tx_queue, &tx_item, pdMS_TO_TICKS(100)) != pdPASS) {
            // Reset watchdog after queue wait timeout
            esp_task_wdt_reset();
            continue; // No message available, go back to outer loop
        }

        // Reset watchdog after successful queue receive
        esp_task_wdt_reset();

        // Check if this frame has expired
        uint64_t now_us = AP_HAL::micros64();
        if (tx_item.deadline_us != 0 && now_us > tx_item.deadline_us) {
            static uint32_t expired_count = 0;
            expired_count++;
            // Only log first few expired frames to avoid spam
            if (expired_count <= 5 || expired_count % 10 == 0) {
                CAN_DEBUG_VERBOSE("Dropped expired frame ID=0x%08X (deadline=%llu, now=%llu) [count=%lu]",
                       (unsigned)tx_item.frame.id, tx_item.deadline_us, now_us, (unsigned long)expired_count);
            }
            continue; // Skip expired frame
        }

        // Verbose frame-by-frame TX logging
        char data_str[32] = {0};
        for (int i = 0; i < tx_item.frame.dlc && i < 8; i++) {
            snprintf(data_str + (i * 3), sizeof(data_str) - (i * 3), "%02X ", tx_item.frame.data[i]);
        }
        CAN_DEBUG_VERBOSE("TX: ID=0x%08X DLC=%d DATA=[%s]", (unsigned)tx_item.frame.id, tx_item.frame.dlc, data_str);

        twai_message_t message;
        memset(&message, 0, sizeof(message));
        
        // Check if this is an extended frame (bit 31 set means extended)
        if (tx_item.frame.isExtended()) {
            // Extended frame: strip the FlagEFF bit and use only the 29-bit ID
            message.identifier = tx_item.frame.id & AP_HAL::CANFrame::MaskExtID;
            message.extd = 1;
            
            // Validate that the ID is within 29-bit range
            if (message.identifier > 0x1FFFFFFF) {
                CAN_DEBUG_ERROR("Invalid extended CAN ID 0x%08X (exceeds 29-bit max), masking to 29 bits", 
                               (unsigned)tx_item.frame.id);
                message.identifier &= 0x1FFFFFFF;
            }
        } else {
            // Standard frame: use only the 11-bit ID
            message.identifier = tx_item.frame.id & AP_HAL::CANFrame::MaskStdID;
            message.extd = 0;
            
            // Validate that the ID is within 11-bit range
            if (message.identifier > 0x7FF) {
                CAN_DEBUG_ERROR("Invalid standard CAN ID 0x%08X (exceeds 11-bit max), masking to 11 bits", 
                               (unsigned)tx_item.frame.id);
                message.identifier &= 0x7FF;
            }
        }
        
        // Validate and clamp DLC to valid range
        if (tx_item.frame.dlc > 8) {
            CAN_DEBUG_ERROR("Invalid DLC %d for message ID=0x%08X, clamping to 8", 
                           tx_item.frame.dlc, (unsigned)tx_item.frame.id);
            message.data_length_code = 8;
        } else {
            message.data_length_code = tx_item.frame.dlc;
        }
        
        message.rtr = tx_item.frame.isRemoteTransmissionRequest() ? 1 : 0;
        message.ss = 0;    // Allow retransmission
        message.self = 0;  // Not self-reception
        memcpy(message.data, tx_item.frame.data, message.data_length_code);
        
        // Debug CAN ID issues
        // DroneCAN extended frame format: 
        // Bits 28-24: Priority (5 bits)
        // Bits 23-8: Message type (16 bits) 
        // Bit 7: Service not message
        // Bits 6-0: Source node ID (7 bits)
        //uint8_t priority = (message.identifier >> 24) & 0x1F;  // Unused for now
        //uint16_t msg_type = (message.identifier >> 8) & 0xFFFF;  // Unused after removing type 342 debug
        //bool is_service = (message.identifier >> 7) & 0x01;  // Unused for now
        //uint8_t source_node = message.identifier & 0x7F;  // Unused after removing type 342 debug
        
        // FlagEFF (bit 31) is normal for extended frame format - no need to log
        
        // CAN message counting disabled - not needed in production
        
        
        // Commented out verbose logging

