Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
        // Single transmission attempt for DroneCAN compliance
        // DroneCAN handles reliability at protocol layer, HAL retries violate timing assumptions
        const TickType_t timeout_ms = 10; // Allow sufficient time for transmission

#if CONFIG_HAL_BOARD == HAL_BOARD_ESP32
        // Check if this is a GetNodeInfo response and log what we're sending
        if ((message.flags & TWAI_MSG_FLAG_EXTD) &&
            ((message.identifier & 0xFF80) == 0x0180)) { // Service frame, type 1
            bool is_response = ((message.identifier >> 15) & 1) == 0;
            if (is_response) {
                uint8_t dest = (message.identifier >> 8) & 0x7F;
                uint8_t src = message.identifier & 0x7F;
                static uint32_t resp_count = 0;
                resp_count++;
                if (resp_count <= 20) {
                    ESP_LOGI("TWAI_TX", "Sending GetNodeInfo response #%lu: CAN ID=0x%08lX",
                             (unsigned long)resp_count, (unsigned long)message.identifier);
                    ESP_LOGI("TWAI_TX", "  From node %d to node %d", src, dest);

                    // Log the actual bytes being sent to TWAI
                    ESP_LOGI("TWAI_TX", "  TWAI msg: id=0x%08lX, flags=0x%02X, dlc=%d",
                             (unsigned long)message.identifier, message.flags, message.data_length_code);
                }
            }
        }
#endif

        // Special debug for GetNodeInfo responses
#if CONFIG_HAL_BOARD == HAL_BOARD_ESP32
        if ((message.identifier & 0xFF80) == 0x0180 && ((message.identifier >> 15) & 1) == 0) {
            uint8_t dest_before = (message.identifier >> 8) & 0x7F;
            ESP_LOGW("TWAI_BUG", "About to transmit GetNodeInfo response to node %d, ID=0x%08lX",
                     dest_before, (unsigned long)message.identifier);
        }
#endif

        esp_err_t result = twai_transmit(&message, pdMS_TO_TICKS(timeout_ms));

#if CONFIG_HAL_BOARD == HAL_BOARD_ESP32
        if ((message.identifier & 0xFF80) == 0x0180 && ((message.identifier >> 15) & 1) == 0) {
            uint8_t dest_after = (message.identifier >> 8) & 0x7F;
            ESP_LOGW("TWAI_BUG", "After transmit GetNodeInfo response: dest=%d, result=%d",
                     dest_after, result);
            // Check if TWAI modified the message
            if (dest_after != ((message.identifier >> 8) & 0x7F)) {
                ESP_LOGE("TWAI_BUG", "TWAI MODIFIED THE CAN ID DURING TRANSMISSION!");
            }
        }
#endif
        
        if (result == ESP_OK) {
            // Track for self-reception filtering
            iface->tx_tracker[iface->tx_tracker_index].can_id = message.identifier;
            iface->tx_tracker[iface->tx_tracker_index].timestamp_us = AP_HAL::micros64();
            iface->tx_tracker[iface->tx_tracker_index].loopback_requested = (tx_item.flags & AP_HAL::CANIface::Loopback) != 0;
            iface->tx_tracker_index = (iface->tx_tracker_index + 1) % TX_TRACKER_SIZE;
        }
        
        // Update statistics and handle errors
        iface->update_tx_stats(result == ESP_OK);
        
        if (result != ESP_OK) {
            // Handle specific TWAI error conditions
            if (result == ESP_ERR_TIMEOUT) {
                // TX timeout - bus may be congested or disconnected
                // Count timeouts but don't log them - stats are tracked elsewhere
                static uint32_t timeout_count = 0;
                timeout_count++;
                // Disabled - CAN stats are available via MAVLink
                // Only enable for debugging CAN issues
#if 0
                if (timeout_count <= 5 || (timeout_count % 1000) == 0) {
                    CAN_DEBUG_WARN("TX timeout on message ID=0x%08X (total timeouts=%lu)",
                                   (unsigned)(tx_item.frame.id & AP_HAL::CANFrame::MaskExtID),
                                   (unsigned long)timeout_count);
                }
#endif
            } else if (result == ESP_FAIL) {
                // TX failed - check bus state
                twai_status_info_t twai_status;
                if (twai_get_status_info(&twai_status) == ESP_OK) {
                    if (twai_status.state == TWAI_STATE_BUS_OFF) {
                        // Bus-off condition detected - use rate-limited logging
                        iface->log_bus_state(BusState::BUS_OFF);
                        iface->update_error_stats(0x01); // Bus-off error code

                        // Attempt bus recovery
                        twai_initiate_recovery();
                        // Note: Recovery is automatic in TWAI driver
                    }
                }
                // Reduce log spam - only log occasionally
                static uint32_t fail_count = 0;
                fail_count++;
                if (fail_count <= 5 || (fail_count % 100) == 0) {
                    CAN_DEBUG_ERROR("Failed to transmit message ID=0x%08X, error=%d (count=%lu)", 
                                    (unsigned)(tx_item.frame.id & AP_HAL::CANFrame::MaskExtID), 
                                    result, (unsigned long)fail_count);
                }
            } else if (result == ESP_ERR_INVALID_STATE) {
                // TWAI driver in invalid state - likely no other nodes on bus or disconnection
                // Continue processing queue to prevent buildup, just can't transmit yet
                static uint32_t last_invalid_state_log_ms = 0;
                static uint32_t invalid_state_count = 0;
                static uint32_t messages_dropped = 0;
                static uint32_t last_recovery_attempt_ms = 0;
                static uint32_t recovery_backoff_ms = 100;  // Start with 100ms backoff
                uint32_t now_ms = AP_HAL::millis();
                invalid_state_count++;
                messages_dropped++;  // Count this as a dropped message

                // Diagnostic: Check actual TWAI state when we get invalid state error
                twai_status_info_t diagnostic_status;
                bool got_status = (twai_get_status_info(&diagnostic_status) == ESP_OK);

                if (got_status) {
                    // Use rate-limited logging for bus state
                    BusState current_state;
                    switch (diagnostic_status.state) {
                        case TWAI_STATE_STOPPED:    current_state = BusState::STOPPED; break;
                        case TWAI_STATE_RUNNING:    current_state = BusState::GOOD; break;
                        case TWAI_STATE_BUS_OFF:    current_state = BusState::BUS_OFF; break;
                        case TWAI_STATE_RECOVERING: current_state = BusState::RECOVERING; break;
                        default:                    current_state = BusState::STOPPED; break;
                    }
                    iface->log_bus_state(current_state);

                    // Additional diagnostic info on first occurrence or occasionally
                    if (invalid_state_count == 1 || (invalid_state_count % 100) == 0) {
                        const char* state_str = "UNKNOWN";
                        switch (diagnostic_status.state) {
                            case TWAI_STATE_STOPPED: state_str = "STOPPED"; break;
                            case TWAI_STATE_RUNNING: state_str = "RUNNING"; break;
                            case TWAI_STATE_BUS_OFF: state_str = "BUS_OFF"; break;
                            case TWAI_STATE_RECOVERING: state_str = "RECOVERING"; break;
                        }
                        CAN_DEBUG_VERBOSE("TX state diagnostics: state=%s, tx_err=%u, rx_err=%u, to_tx=%lu, to_rx=%lu",
                                       state_str,
                                       (unsigned)diagnostic_status.tx_error_counter,
                                       (unsigned)diagnostic_status.rx_error_counter,
                                       (unsigned long)diagnostic_status.msgs_to_tx,
                                       (unsigned long)diagnostic_status.msgs_to_rx);
                    }
                }

