Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
                // Reinitialize with same configuration (use NormalMode as default)
                if (init(saved_bitrate, NormalMode)) {
                    CAN_DEBUG_INFO("Full TWAI restart successful");
                    consecutive_bus_off_count = 0; // Reset counter on successful restart
                    last_full_restart_ms = now_ms;
                } else {
                    CAN_DEBUG_ERROR("Full TWAI restart failed");
                    // Continue with basic recovery attempts
                }
            } else {
                // Standard recovery attempt
                twai_initiate_recovery();
            }
            
            last_recovery_attempt_ms = now_ms;
        }
    } else {
        // Bus is healthy, reset consecutive bus-off counter
        consecutive_bus_off_count = 0;
    }
    
    // Check for excessive TX queue backlog
    if (tx_queue && uxQueueMessagesWaiting(tx_queue) > 100) {
        CAN_DEBUG_WARN("TX queue backlog detected (%u messages)", 
                           (unsigned)uxQueueMessagesWaiting(tx_queue));
        update_error_stats(0x10); // Queue backlog error
    }
    
    // Check for RX overruns
    if (twai_status.rx_missed_count > 0) {
        static uint32_t last_rx_missed = 0;
        if (twai_status.rx_missed_count > last_rx_missed) {
            CAN_DEBUG_WARN("RX overrun detected (missed %u messages)", 
                               (unsigned)(twai_status.rx_missed_count - last_rx_missed));
            update_error_stats(0x20); // RX overrun error
        }
        last_rx_missed = twai_status.rx_missed_count;
    }
}

void CANIface::log_bus_state(BusState new_state)
{
    uint32_t now_ms = AP_HAL::millis();

    // Detect state transitions
    if (new_state != last_bus_state) {
        // State changed - log the transition with power failure diagnostics
        if (new_state == BusState::GOOD) {
            // Recovery - calculate downtime
            if (bus_state_change_ms > 0) {
                float downtime_sec = (now_ms - bus_state_change_ms) / 1000.0f;
                ESP_LOGE("CAN", "Bus recovered to GOOD after %.2f seconds", downtime_sec);
            } else {
                ESP_LOGI("CAN", "Bus initialized to GOOD state");
            }
        } else if (new_state == BusState::BUS_OFF) {
            // Get detailed diagnostics when entering BUS_OFF (power failure indicator)
            twai_status_info_t diag;
            if (twai_get_status_info(&diag) == ESP_OK) {
                // Track error counter history for rate-of-change analysis
                static uint32_t last_tx_err = 0;
                static uint32_t last_rx_err = 0;
                static uint32_t last_check_ms = 0;
                uint32_t delta_ms = (last_check_ms > 0) ? (now_ms - last_check_ms) : 0;
                uint32_t tx_delta = (diag.tx_error_counter > last_tx_err) ?
                                    (diag.tx_error_counter - last_tx_err) : 0;
                uint32_t rx_delta = (diag.rx_error_counter > last_rx_err) ?
                                    (diag.rx_error_counter - last_rx_err) : 0;

                ESP_LOGE("CAN_POWER", "=== BUS_OFF POWER/EMI DIAGNOSTICS ===");
                ESP_LOGE("CAN_POWER", "Error counters: TX=%u (+%lu in %lums), RX=%u (+%lu in %lums)",
                         (unsigned)diag.tx_error_counter, (unsigned long)tx_delta, (unsigned long)delta_ms,
                         (unsigned)diag.rx_error_counter, (unsigned long)rx_delta, (unsigned long)delta_ms);
                ESP_LOGE("CAN_POWER", "Msgs pending: TX=%lu, RX=%lu",
                         (unsigned long)diag.msgs_to_tx, (unsigned long)diag.msgs_to_rx);
                ESP_LOGE("CAN_POWER", "Heap: free=%lu min=%lu",
                         (unsigned long)esp_get_free_heap_size(),
                         (unsigned long)esp_get_minimum_free_heap_size());
                ESP_LOGE("CAN_POWER", "Uptime: %lums since boot", (unsigned long)now_ms);
                ESP_LOGE("CAN_POWER", "");
                ESP_LOGE("CAN_POWER", "DIAGNOSIS GUIDE:");
                ESP_LOGE("CAN_POWER", "  POWER DROP: Both TX/RX deltas >50, sudden failure, heap stable");
                ESP_LOGE("CAN_POWER", "  EMI (mLRS): TX delta >50, RX delta <20, correlates with RF TX");
                ESP_LOGE("CAN_POWER", "  SOFTWARE: Heap decreasing, one counter stuck, gradual degradation");
                ESP_LOGE("CAN_POWER", "====================================");

                // Update history
                last_tx_err = diag.tx_error_counter;
                last_rx_err = diag.rx_error_counter;
                last_check_ms = now_ms;
            } else {
                ESP_LOGE("CAN", "Bus entered BUS_OFF state (cannot read diagnostics)");
            }
        } else if (new_state == BusState::STOPPED) {
            ESP_LOGE("CAN", "Bus entered STOPPED state");
        } else if (new_state == BusState::RECOVERING) {
            ESP_LOGE("CAN", "Bus entered RECOVERING state");
        }

        // Update tracking variables
        last_bus_state = new_state;
        bus_state_change_ms = now_ms;
        last_bus_error_log_ms = now_ms;
    } else if (new_state != BusState::GOOD) {
        // Still in error state - check if we should log periodic update
        if (now_ms - last_bus_error_log_ms >= 30000) {  // 30 seconds
            float downtime_sec = (now_ms - bus_state_change_ms) / 1000.0f;
            const char* state_str = "UNKNOWN";
            switch (new_state) {
                case BusState::BUS_OFF:     state_str = "BUS_OFF"; break;
                case BusState::STOPPED:     state_str = "STOPPED"; break;
                case BusState::RECOVERING:  state_str = "RECOVERING"; break;
                default: break;
            }
            ESP_LOGE("CAN", "Bus still %s - down for %.2f seconds", state_str, downtime_sec);
            last_bus_error_log_ms = now_ms;
        }
    }
    // If state is GOOD and was already GOOD, no logging needed
}

void CANIface::attempt_driver_restart()
{
    static uint32_t last_restart_ms = 0;
    static uint32_t restart_count = 0;
    uint32_t now_ms = AP_HAL::millis();

    // Rate limit restarts to prevent restart loops
    if (now_ms - last_restart_ms < 5000) {  // Minimum 5 seconds between restarts (reduced from 30s)
        // Only log periodically to avoid spam
        static uint32_t last_log_ms = 0;
        if (now_ms - last_log_ms > 2000) {  // Log at most every 2 seconds
            CAN_DEBUG_INFO("Driver restart rate-limited (last restart %lu ms ago)", (unsigned long)(now_ms - last_restart_ms));
            last_log_ms = now_ms;
        }
        return;
    }

    // Prevent multiple simultaneous restart attempts
    if (restart_in_progress) {
        CAN_DEBUG_INFO("Driver restart already in progress, skipping");
        return;
    }
    
    restart_count++;
    last_restart_ms = now_ms;
    
    // Only log restart attempts periodically to reduce spam
    if (restart_count <= 3 || (restart_count % 10) == 0) {
        CAN_DEBUG_ERROR("TWAI driver restart #%lu (invalid state)", (unsigned long)restart_count);
    }
    
    // Store current configuration
    uint32_t saved_bitrate = current_bitrate;
    
    // Stop and uninstall driver (may fail if in invalid state, but continue anyway)
    // Set a flag to signal RX/TX tasks to pause during restart
    restart_in_progress = true;

