Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
    // Give RX/TX tasks time to see the flag and exit any blocking calls
    // The RX timeout is 100ms, so wait at least that long
    // Feed watchdog during this delay
    hal.scheduler->delay(200); // 200ms to ensure RX task sees timeout and checks flag, with watchdog feeding

    // Now attempt to stop TWAI - use non-blocking approach
    esp_err_t result = ESP_OK;

    // Check current state first
    twai_status_info_t status;
    if (twai_get_status_info(&status) == ESP_OK) {
        CAN_DEBUG_INFO("TWAI state before stop: %d, msgs_to_tx: %lu, msgs_to_rx: %lu",
                       status.state, (unsigned long)status.msgs_to_tx, (unsigned long)status.msgs_to_rx);

        // Only try to stop if not already stopped
        if (status.state != TWAI_STATE_STOPPED) {
            result = twai_stop();
            if (result != ESP_OK && result != ESP_ERR_INVALID_STATE) {
                CAN_DEBUG_WARN("TWAI stop failed (error %d), forcing uninstall", result);
            }
            // Give driver time to fully stop
            hal.scheduler->delay(50); // Allow TWAI to fully stop
        }
    }

    // Always try to uninstall, even if stop failed
    result = twai_driver_uninstall();
    if (result != ESP_OK) {
        CAN_DEBUG_WARN("TWAI uninstall failed (error %d), continuing anyway", result);
    }

    // Brief delay to let hardware settle
    hal.scheduler->delay(10); // 10ms with watchdog feeding
    
    // Clear queues (they should be empty after stop/uninstall, but be safe)
    if (rx_queue) {
        xQueueReset(rx_queue);
    }
    if (tx_queue) {
        xQueueReset(tx_queue);
    }
    
    // Reinitialize with saved configuration
    initialized = false;
    bool reinit_ok = init(saved_bitrate, NormalMode);

    if (reinit_ok) {
        // Give TWAI driver time to fully stabilize before allowing tasks to resume
        hal.scheduler->delay(50); // 50ms for TWAI to stabilize, with watchdog feeding

        // Now clear the restart flag to allow tasks to resume
        restart_in_progress = false;

        CAN_DEBUG_INFO("TWAI driver restart successful after %lu restarts", (unsigned long)restart_count);
        update_error_stats(0x00); // Clear error state
    } else {
        // Clear flag even on failure to prevent permanent task blocking
        restart_in_progress = false;

        CAN_DEBUG_ERROR("TWAI driver restart failed - interface may be unusable");
    }
}

#endif // HAL_NUM_CAN_IFACES > 0
